In [1]:
import numpy as np
import pandas as pd
from sklearn import linear_model

In [2]:
df = pd.read_csv("sal_reg.csv")

In [3]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [26]:
from word2number import w2n

In [44]:
df1 = df.copy()

In [45]:
df1['experience'] = df1['experience'].fillna('zero')

In [46]:
df1

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [47]:
df1['experience'] = list(map(w2n.word_to_num, df1['experience']))

In [37]:
df1

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [ ]:
# df1["test_score(out of 10)"] =[ for x,y in zip(df1["test_score(out of 10)"],df1["interview_score(out of 10)"]) if np.isnan(x) ]

In [48]:
df1["test_score(out of 10)"] = df1["test_score(out of 10)"].fillna(df1["interview_score(out of 10)"])

In [49]:
df1

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    7.0                           7      72000
7          11                    7.0                           8      80000

In [56]:
reg = linear_model.LinearRegression()
reg.fit(df1[df1.columns[:-1]], df1[df1.columns[-1]])

LinearRegression()

In [62]:
reg.predict([[7,10,10]])

/Users/pranayspeed/miniconda3/envs/dev/lib/python3.10/site-packages/sklearn/base.py:465: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([79136.4512114])

In [78]:
df2 = df.copy()

In [79]:
df2

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [80]:
df2[df2.columns[0]] = df2[df2.columns[0]].fillna('zero')

In [81]:
df2

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [84]:
df2[df2.columns[0]].unique()

array(['zero', 'five', 'two', 'seven', 'three', 'ten', 'eleven'],
      dtype=object)

In [85]:
str2num ={'zero':0, 'five':5, 'two':2, 'seven':7, 'three':3, 'ten':10, 'eleven':11}
def strtonum(s):
    return str2num[s]

In [86]:
df2[df2.columns[0]] = list(map(lambda s: str2num[s],df2[df2.columns[0]]))

In [87]:
df2

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [88]:
df2["test_score(out of 10)"] = df2["test_score(out of 10)"].fillna(df2["interview_score(out of 10)"])

In [89]:
df2

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    7.0                           7      72000
7          11                    7.0                           8      80000

In [92]:
reglogistic = linear_model.LogisticRegression(solver='liblinear')
reglin = linear_model.LinearRegression()

reglogistic.fit(df2[df2.columns[:-1]], df2[df2.columns[-1]])
reglin.fit(df2[df2.columns[:-1]], df2[df2.columns[-1]])

LinearRegression()

In [94]:
reglogistic.predict([[7,5,10]]), reglin.predict([[7,5,10]])

/Users/pranayspeed/miniconda3/envs/dev/lib/python3.10/site-packages/sklearn/base.py:465: UserWarning: X does not have valid feature names, but LogisticRegression was fitted with feature names
  warnings.warn(
/Users/pranayspeed/miniconda3/envs/dev/lib/python3.10/site-packages/sklearn/base.py:465: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

(array([62000]), array([68029.90571346]))